simulations/CFD/ngo/sonicFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (42 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            noSlip;
    }

/*
    "inlet.*"
    {
        type            supersonicFreestream;
        pInf            $pressure;
        TInf            $temperature;
        UInf            $flowVelocity;
        gamma           1.4;
        value           $internalField;
    }

    "outlet.*"
    {
        type            inletOutlet;
        inletValue      uniform $flowVelocity;
        value           $internalField;
    }

    "sym.*"
    {
        type            empty;
    }

    "wall.*"
    {
        type            noSlip;
    }
*/
}

// ************************************************************************* //
