simulations/CFD/ngo/sonicFoam/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    outlet
    {
        type            totalPressure;
        p0              $internalField;
	    value           $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2800000;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }

/*
    "inlet.*"
    {
        type            zeroGradient;
    }

    "outlet.*"
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        $pressure;
        lInf            1;
        value           $internalField;
    }

    "sym.*"
    {
        type            empty;
    }

    "wall.*"
    {
        type            zeroGradient;
    }
/*/
}

// ************************************************************************* //
